#+title: Week 13 NS
#+PROPERTY: header-args:python :session: week-13

** Data Acquisition & Exploration.
Due to me being given the dataset, I don't have to go looking for it; but if I were to have to, I'd consider research organiztions, open-source sets/kaggle, or maybe just asking the client that this is for to supply some. Besides this, I can move towards exploring the data to make sure the set is clean and properly labled.

#+begin_src python :results output :session week-13 
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt 
from matplotlib.colors import ListedColormap
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, confusion_matrix, classification_report

from sklearn.neighbors import KNeighborsClassifier
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier

df = pd.read_csv("/home/nate/NextCloud/Roam/Classes/Intro_to_ML/assignmnets/week_13/[Dataset]_BreastCancer.csv")

print(df)
#+end_src

#+RESULTS:
#+begin_example
           id diagnosis  radius_mean  texture_mean  perimeter_mean  ...  compactness_worst  concavity_worst  concave points_worst  symmetry_worst  fractal_dimension_worst
0      842302         M        17.99           NaN          122.80  ...            0.66560           0.7119                0.2654          0.4601                  0.11890
1      842517         M        20.57         17.77          132.90  ...            0.18660           0.2416                0.1860          0.2750                  0.08902
2    84300903         M        19.69         21.25          130.00  ...            0.42450           0.4504                0.2430          0.3613                  0.08758
3    84348301         M        11.42         20.38           77.58  ...            0.86630           0.6869                0.2575          0.6638                  0.17300
4    84358402         M        20.29         14.34          135.10  ...            0.20500           0.4000                0.1625          0.2364                  0.07678
..        ...       ...          ...           ...             ...  ...                ...              ...                   ...             ...                      ...
564    926424         M        21.56         22.39          142.00  ...            0.21130           0.4107                0.2216          0.2060                  0.07115
565    926682         M        20.13         28.25          131.20  ...            0.19220           0.3215                0.1628          0.2572                  0.06637
566    926954         M        16.60         28.08          108.30  ...            0.30940           0.3403                0.1418          0.2218                  0.07820
567    927241         M        20.60         29.33          140.10  ...            0.86810           0.9387                0.2650          0.4087                  0.12400
568     92751         B         7.76         24.54           47.92  ...            0.06444           0.0000                0.0000          0.2871                  0.07039

[569 rows x 32 columns]
#+end_example

*** After printing some of the features and observations, I don't find anything 'dirty' but I should try doing a more direct search for missing values within the dataset.
#+begin_src python :results output :session week-13
print(df.isnull().values.sum())
print(df.isnull().sum())
#+end_src

#+RESULTS:
#+begin_example
28
id                         0
diagnosis                  0
radius_mean                0
texture_mean               1
perimeter_mean             1
area_mean                  0
smoothness_mean            0
compactness_mean           1
concavity_mean             1
concave points_mean        1
symmetry_mean              0
fractal_dimension_mean     3
radius_se                  0
texture_se                 0
perimeter_se               0
area_se                    0
smoothness_se              3
compactness_se             4
concavity_se               2
concave points_se          1
symmetry_se                3
fractal_dimension_se       0
radius_worst               1
texture_worst              3
perimeter_worst            0
area_worst                 2
smoothness_worst           1
compactness_worst          0
concavity_worst            0
concave points_worst       0
symmetry_worst             0
fractal_dimension_worst    0
dtype: int64
#+end_example

To take note of what I did to figure what I've just found, I had first printed the sum of values which are null within the complete dataframe, showing itself as the the columns which have such observations. Second, I had printed the sum of total null values within those columns, showing how many obvservations are empty.

For time's sake and due to the large amount of other features with filled-in observations, I'm going to drop these null values within their respective rows for clean up.

#+begin_src python :results output :session week-13
df.dropna(inplace=True)
print(df)
#+end_src

#+RESULTS:
#+begin_example
           id diagnosis  radius_mean  texture_mean  perimeter_mean  ...  compactness_worst  concavity_worst  concave points_worst  symmetry_worst  fractal_dimension_worst
1      842517         M        20.57         17.77          132.90  ...            0.18660           0.2416                0.1860          0.2750                  0.08902
2    84300903         M        19.69         21.25          130.00  ...            0.42450           0.4504                0.2430          0.3613                  0.08758
3    84348301         M        11.42         20.38           77.58  ...            0.86630           0.6869                0.2575          0.6638                  0.17300
4    84358402         M        20.29         14.34          135.10  ...            0.20500           0.4000                0.1625          0.2364                  0.07678
5      843786         M        12.45         15.70           82.57  ...            0.52490           0.5355                0.1741          0.3985                  0.12440
..        ...       ...          ...           ...             ...  ...                ...              ...                   ...             ...                      ...
563    926125         M        20.92         25.09          143.00  ...            0.41860           0.6599                0.2542          0.2929                  0.09873
564    926424         M        21.56         22.39          142.00  ...            0.21130           0.4107                0.2216          0.2060                  0.07115
565    926682         M        20.13         28.25          131.20  ...            0.19220           0.3215                0.1628          0.2572                  0.06637
567    927241         M        20.60         29.33          140.10  ...            0.86810           0.9387                0.2650          0.4087                  0.12400
568     92751         B         7.76         24.54           47.92  ...            0.06444           0.0000                0.0000          0.2871                  0.07039

[543 rows x 32 columns]
#+end_example

where I can see that had dropped around 30+ rows!
*** Modifying the Target Column
Looking through dataset, I find that there doesn't exist a pre-defined 'target' column which will be important later for easy of identification during model use; as well, such a colum needs to be in the proper format, like numerical, in order to be used in certain models.

#+begin_src python :results output :session week-13
df = df.rename(columns={'diagnosis':'target'})

sns.countplot(df['target'])
print(df.target.value_counts())
#+end_src

#+RESULTS:
: target
: B    342
: M    201
: Name: count, dtype: int64

So it can be seen that this is done by re-declaring the 'df' object as the image of the method 'rename' which exchanges the column's name 'diagnosis' to 'target'; then I just went and used seaborn to create a simple count plot to show the observations attached to the feature. Notice though how this is the count of B & M, which is to say such observations are not numerical but rather caterogically, and here I was just counting the amount of such categorically observations.

This means I have to convert such a binary classifcation to just that: binary intergers.

#+begin_src python :results output :session week-13
df['target'] = [1 if i.strip()=='M' else 0 for i in df.target]
#+end_src

#+RESULTS:
*** Splitting into sets
From here I can start to split the dataframe/set into the needed subsets for training and testing, split by their axes.

#+begin_src python :results output :session week-13 
X = df.drop(['target'], axis=1)
y = df['target']
columns = X.columns.tolist()

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)
print('X_train.shape:', X_train.shape)
print('X_test.shape', X_test.shape)
#+end_src

#+RESULTS:
: X_train.shape: (434, 31)
: X_test.shape (109, 31)

not bad, but the difference between those features is insane: I'll standardize the data to decrease this difference.

#+begin_src python :results output :session week-13
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

X_train_df = pd.DataFrame(X_train, columns = columns)
X_train_df["target"] = y_train

print('X_train.shape:', X_train.shape)
print('X_test.shape', X_test.shape)
#+end_src

#+RESULTS:

Before moving forward, it might be a good question to ask two things
- What excatly am I standardizing?
  The values which were standarized was rather the scale of the data rather then the values of the data itself. If one were to look through the data, they would see some of the values being of a very small decimal while other of large intergers: that can be bit of a problem when preforming analysis.
- Why did I set y_train but not y_test to the 'target' feature?
  y_train was assinged here due to it needing to be re-assigned after standardization; y_test is just the 

